cse_8803_anlp/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-01-24 Wed 18:19 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>CSE 8803: Applied Natural Language Processing</title>
<meta name="author" content="W" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">CSE 8803: Applied Natural Language Processing</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org9676b7a">1. Week 2: (Discrete) Text Representations</a>
<ul>
<li><a href="#orgea4a851">1.1. Why?</a></li>
<li><a href="#orgee85252">1.2. Representing Words</a></li>
<li><a href="#orgcbf898e">1.3. Representing sentences/documents</a></li>
<li><a href="#org523e02e">1.4. One Hot Encoding</a>
<ul>
<li><a href="#orgf469b3c">1.4.1. Definitions</a></li>
<li><a href="#org07b021f">1.4.2. Advantages and disadvantages</a></li>
</ul>
</li>
<li><a href="#orgafadf28">1.5. Bag of Words (Frequency Counting)</a>
<ul>
<li><a href="#orgcb67e17">1.5.1. Advantages and disadvantages</a></li>
</ul>
</li>
<li><a href="#org42ba909">1.6. TF-IDF (Term Frequency-Inverse Document Frequency)</a>
<ul>
<li><a href="#org40c3ba7">1.6.1. Why needed?</a></li>
<li><a href="#org6fbffa9">1.6.2. What is TF-IDF and when to use TF-IDF</a></li>
<li><a href="#org475c3a3">1.6.3. Advantages and disadvantages</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org9676b7a" class="outline-2">
<h2 id="org9676b7a"><span class="section-number-2">1.</span> Week 2: (Discrete) Text Representations</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgea4a851" class="outline-3">
<h3 id="orgea4a851"><span class="section-number-3">1.1.</span> Why?</h3>
<div class="outline-text-3" id="text-1-1">
<dl class="org-dl">
<dt>NLP</dt><dd>design algorithms to allow computers to understand natural language, so as to perform some task</dd>
<dt>Required</dt><dd>convert text data to numerical data that can be used in model</dd>
</dl>
</div>
</div>
<div id="outline-container-orgee85252" class="outline-3">
<h3 id="orgee85252"><span class="section-number-3">1.2.</span> Representing Words</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Can be represented by vectors of 0 &amp; 1 where 1 indicates the position of the word, e.g. lorem = <code>[1, 0]</code>, ipsum = <code>[0, 1]</code>, etc.</li>
</ul>
</div>
</div>
<div id="outline-container-orgcbf898e" class="outline-3">
<h3 id="orgcbf898e"><span class="section-number-3">1.3.</span> Representing sentences/documents</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>Vectors of vectors eg <code>[[1,0], [0,1]]</code></li>
</ul>
</div>
</div>
<div id="outline-container-org523e02e" class="outline-3">
<h3 id="org523e02e"><span class="section-number-3">1.4.</span> One Hot Encoding</h3>
<div class="outline-text-3" id="text-1-4">
</div>
<div id="outline-container-orgf469b3c" class="outline-4">
<h4 id="orgf469b3c"><span class="section-number-4">1.4.1.</span> Definitions</h4>
<div class="outline-text-4" id="text-1-4-1">
<dl class="org-dl">
<dt>corpus</dt><dd>all texts</dd>
<dt>vocabulary, <span class="underline">V</span></dt><dd>all unique words</dd>
<dt>vocabulary size, <span class="underline">d</span></dt><dd>number of unique words, "dimensions"</dd>
<dt>word, <span class="underline">w</span></dt><dd>represented by vector \(X\)</dd>
</dl>
<p>
\(X^w_i\) = 1 if idw(w) = 1, 0 otherwise
</p>
<dl class="org-dl">
<dt>document</dt><dd>represented by matrix sized \(n \times d\)</dd>
<dt><span class="underline">n</span></dt><dd>number of words in document</dd>
<dt><span class="underline">d</span></dt><dd>a single vector with multiple values of 1 where vocab. words are present</dd>
<dt>Document, <span class="underline">D</span></dt><dd>e.g. <span class="underline">this is a sentence</span></dd>
<dt>Vocabulary, <span class="underline">V</span></dt><dd>e.g. <code>[aardvark, ..., sentence, ..., zither]</code></dd>
<dt>OHE, \(X^D\)</dt><dd><code>[0, ..., 1, ...1]</code></dd>
</dl>
</div>
</div>
<div id="outline-container-org07b021f" class="outline-4">
<h4 id="org07b021f"><span class="section-number-4">1.4.2.</span> Advantages and disadvantages</h4>
<div class="outline-text-4" id="text-1-4-2">
<ul class="org-ul">
<li>Advantages: easy to implement</li>
<li>Disadvantages:
<ul class="org-ul">
<li>not scalable for large vocabulary</li>
<li>high dimensional sparse matrix results in expensive memory + computation</li>
<li><p>
each word represented individually, hence <b>no notion of similarity or meaning</b>. All vectors are orthogonal
</p>

<p>
\((w^{good})^T \cdot w^{great} = (w^{good})^T \cdot w^{bad} = 0\)
</p></li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgafadf28" class="outline-3">
<h3 id="orgafadf28"><span class="section-number-3">1.5.</span> Bag of Words (Frequency Counting)</h3>
<div class="outline-text-3" id="text-1-5">
<dl class="org-dl">
<dt>Summary</dt><dd>Represents each document as a bag of words. <b><b>Ignores</b></b> order of words.</dd>
<dt>Document</dt><dd>a column vector of \(X\) word counts</dd>
<dt>Representation</dt><dd>Fixed-length representation</dd>
<dt>Document, <span class="underline">D</span></dt><dd>e.g. <code>It was the best of times, it was the worst of times</code></dd>
<dt>Vocabulary, <span class="underline">V</span></dt><dd>e.g. <code>[aardvark, ..., zither]</code></dd>
<dt>Bag of words: <span class="underline">X</span></dt><dd>[2, &#x2026;, 1]</dd>
<dt>Size of <span class="underline">X</span></dt><dd>\(1 \times d\) (\(d\) = vocabulary size)</dd>
</dl>
<p>
Hence \(n\) documents can be represented by matrix of size \(n \times d\).
</p>
</div>
<div id="outline-container-orgcb67e17" class="outline-4">
<h4 id="orgcb67e17"><span class="section-number-4">1.5.1.</span> Advantages and disadvantages</h4>
<div class="outline-text-4" id="text-1-5-1">
<ul class="org-ul">
<li>Advantages: easy to implement</li>
<li>Disadvantages:
<ul class="org-ul">
<li>Not scalable for large vocabulary</li>
<li>high dimensional sparse matrix results in expensive memory + computation</li>
<li>Order of words is disregarded; <b><b>no meaning</b></b> from context</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org42ba909" class="outline-3">
<h3 id="org42ba909"><span class="section-number-3">1.6.</span> TF-IDF (Term Frequency-Inverse Document Frequency)</h3>
<div class="outline-text-3" id="text-1-6">
</div>
<div id="outline-container-org40c3ba7" class="outline-4">
<h4 id="org40c3ba7"><span class="section-number-4">1.6.1.</span> Why needed?</h4>
<div class="outline-text-4" id="text-1-6-1">
<ul class="org-ul">
<li>BoW does not provide logical importance
<ul class="org-ul">
<li>i.e., each word is equally important</li>
</ul></li>
<li>TF-IDF assigns more logical importance to words in each document</li>
</ul>
</div>
</div>
<div id="outline-container-org6fbffa9" class="outline-4">
<h4 id="org6fbffa9"><span class="section-number-4">1.6.2.</span> What is TF-IDF and when to use TF-IDF</h4>
<div class="outline-text-4" id="text-1-6-2">
<dl class="org-dl">
<dt>Definition of TF-IDF</dt><dd>a word's <b><b>importance score</b></b> in a document among \(N\) documents</dd>
<dt><span class="underline">N</span></dt><dd>total number of documents</dd>
<dt>Word count</dt><dd>likely TF-IDF</dd>
<dt>Term frequency, <span class="underline">TF</span></dt><dd>the number of times a word appears in <b><b>a document</b></b>.
TF is high if word appears many times in document, e.g. <span class="underline">the</span>, <span class="underline">a</span>, etc.</dd>
<dt>Inverse document frequency, <span class="underline">IDF</span></dt><dd>\(\log(\frac{N}{\text{number of docs containing the term}})\).
If all (or most) documents contain that term, then IDF will be <b><b>very small</b></b></dd>
<dt>Word's importance score</dt><dd>\(TF \times IDF\).
Higher score = more "characteristic"</dd>
</dl>
</div>
</div>
<div id="outline-container-org475c3a3" class="outline-4">
<h4 id="org475c3a3"><span class="section-number-4">1.6.3.</span> Advantages and disadvantages</h4>
<div class="outline-text-4" id="text-1-6-3">
<ul class="org-ul">
<li>Advantages:
<ul class="org-ul">
<li>Easy to implement</li>
<li>Higher score = "more characteristic". Common words will have very small scores.</li>
<li>Good technique to search for documents, find similar documents, cluster documents</li>
</ul></li>
<li>Disadvantages
<ul class="org-ul">
<li>Does not consider position of words when creating matrix. Similar problem as with BoW.</li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: W</p>
<p class="date">Created: 2024-01-24 Wed 18:19</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
